# ETL Processes
Use this notebook to develop the ETL process for each of your tables before completing the `etl.py` file to load the whole datasets.

In [1]:
import os
import glob
import psycopg2
import pandas as pd
import importlib
from sql_queries import *

In [2]:
def create_tables(cur, conn):
    """
    Creates each table using the queries in `create_table_queries` list. 
    """
    for query in create_table_queries:
        cur.execute(query)
        conn.commit()

def create_database():
    """
    - Creates and connects to the sparkifydb
    - Returns the connection and cursor to sparkifydb
    """
    
    # connect to default database
    conn = psycopg2.connect("host=127.0.0.1 dbname=studentdb user=student password=student")
    conn.set_session(autocommit=True)
    cur = conn.cursor()
    
    # create sparkify database with UTF8 encoding
    cur.execute("DROP DATABASE IF EXISTS sparkifydb")
    cur.execute("CREATE DATABASE sparkifydb WITH ENCODING 'utf8' TEMPLATE template0")

    # close connection to default database
    conn.close()    
    
    # connect to sparkify database
    conn = psycopg2.connect("host=127.0.0.1 dbname=sparkifydb user=student password=student")
    cur = conn.cursor()
    
    return cur, conn


def drop_tables(cur, conn):
    """
    Drops each table using the queries in `drop_table_queries` list.
    """
    for query in drop_table_queries:
        cur.execute(query)
        conn.commit()
        
        
# cur, conn = create_database()
# drop_tables(cur, conn)
# create_tables(cur, conn)

In [2]:
%run -i 'create_tables.py'

TypeError: 'NoneType' object is not iterable

In [4]:
conn = psycopg2.connect("host=127.0.0.1 dbname=sparkifydb user=student password=student")
cur = conn.cursor()

In [5]:
def get_files(filepath):
    all_files = []
    for root, dirs, files in os.walk(filepath):
        files = glob.glob(os.path.join(root,'*.json'))
        for f in files :
            all_files.append(os.path.abspath(f))
    
    return all_files

# Process `song_data`
In this first part, you'll perform ETL on the first dataset, `song_data`, to create the `songs` and `artists` dimensional tables.

Let's perform ETL on a single song file and load a single record into each table to start.
- Use the `get_files` function provided above to get a list of all song JSON files in `data/song_data`
- Select the first song in this list
- Read the song file and view the data

In [6]:
song_files = get_files('data/song_data')
song_files_df = pd.DataFrame(song_files, columns=['file_path'])

#removing files from notebook checkpoints
song_files_df = song_files_df[~song_files_df['file_path'].str.contains('checkpoint')]

In [7]:
#loading the data
combined_song_data_df = pd.DataFrame()
count=0
for path in song_files_df['file_path']:
    data_df = pd.read_json(path, lines=True)
    combined_song_data_df = combined_song_data_df.append(data_df)
    count+=1
    print(f"Processing {count} of {len(song_files_df)}", end ="\r")
combined_song_data_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 71 entries, 0 to 0
Data columns (total 10 columns):
artist_id           71 non-null object
artist_latitude     31 non-null float64
artist_location     71 non-null object
artist_longitude    31 non-null float64
artist_name         71 non-null object
duration            71 non-null float64
num_songs           71 non-null int64
song_id             71 non-null object
title               71 non-null object
year                71 non-null int64
dtypes: float64(3), int64(2), object(5)
memory usage: 6.1+ KB

In [8]:
combined_song_data_df.head()

,artist_id,artist_latitude,artist_location,artist_longitude,artist_name,duration,num_songs,song_id,title,year
0,ARD7TVE1187B99BFB1,NaN,California - LA,NaN,Casual,218.93179,1,SOMZWCG12A8C13C480,I Didn't Mean To,0
0,ARNTLGG11E2835DDB9,NaN,,NaN,Clp,266.39628,1,SOUDSGM12AC9618304,Insatiable (Instrumental Version),0
0,AR8ZCNI1187B9A069B,NaN,,NaN,Planet P Project,269.81832,1,SOIAZJW12AB01853F1,Pink World,1984
0,AR10USD1187B99F3F1,NaN,"Burlington, Ontario, Canada",NaN,Tweeterfriendly Music,189.57016,1,SOHKNRJ12A6701D1F8,Drop of Rain,0
0,ARMJAGH1187FB546F3,35.14968,"Memphis, TN",-90.04892,The Box Tops,148.03546,1,SOCIWDW12A8C13D406,Soul Deep,1969

## #1: `songs` Table
#### Extract Data for Songs Table
- Select columns for song ID, title, artist ID, year, and duration
- Use `df.values` to select just the values from the dataframe
- Index to select the first (only) record in the dataframe
- Convert the array to a list and set it to `song_data`

In [9]:
song_data = list(combined_song_data_df[['song_id', 'title', 'artist_id', 'year', 'duration']].values[0])
song_data

['SOMZWCG12A8C13C480', "I Didn't Mean To", 'ARD7TVE1187B99BFB1', 0, 218.93179]

#### Insert Record into Song Table
Implement the `song_table_insert` query in `sql_queries.py` and run the cell below to insert a record for this song into the `songs` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `songs` table in the sparkify database.

In [10]:
cur.execute(song_table_insert, song_data)
conn.commit()

In [11]:
#Saving all the other songs
song_data_df = combined_song_data_df[['song_id', 'title', 'artist_id', 'year', 'duration']].drop_duplicates()
song_data_df[song_data_df['song_id'].duplicated()]
for i, row in song_data_df[1:].iterrows():
    cur.execute(song_table_insert, list(row))
    conn.commit()

Run `test.ipynb` to see if you've successfully added a record to this table.

## #2: `artists` Table
#### Extract Data for Artists Table
- Select columns for artist ID, name, location, latitude, and longitude
- Use `df.values` to select just the values from the dataframe
- Index to select the first (only) record in the dataframe
- Convert the array to a list and set it to `artist_data`

In [12]:
artist_data = list(combined_song_data_df[['artist_id', 'artist_name', 'artist_location', 'artist_latitude', 'artist_longitude']].values[0])
artist_data

['ARD7TVE1187B99BFB1', 'Casual', 'California - LA', nan, nan]

#### Insert Record into Artist Table
Implement the `artist_table_insert` query in `sql_queries.py` and run the cell below to insert a record for this song's artist into the `artists` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `artists` table in the sparkify database.

In [13]:
cur.execute(artist_table_insert, artist_data)
conn.commit()

In [14]:
#Saving all the other artists
artist_data_df = combined_song_data_df[['artist_id', 'artist_name', 'artist_location', 'artist_latitude', 'artist_longitude']].drop_duplicates()
for i, row in artist_data_df[1:].iterrows():
    cur.execute(artist_table_insert, list(row))
    conn.commit()

Run `test.ipynb` to see if you've successfully added a record to this table.

# Process `log_data`
In this part, you'll perform ETL on the second dataset, `log_data`, to create the `time` and `users` dimensional tables, as well as the `songplays` fact table.

Let's perform ETL on a single log file and load a single record into each table.
- Use the `get_files` function provided above to get a list of all log JSON files in `data/log_data`
- Select the first log file in this list
- Read the log file and view the data

In [15]:
log_files = get_files('data/log_data')
log_files_df =  pd.DataFrame(log_files, columns=['file_path'])

In [16]:
#loading the data
combined_log_data_df = pd.DataFrame()
count=0
for path in log_files_df['file_path']:
    data_df = pd.read_json(path, lines=True)
    combined_log_data_df = combined_log_data_df.append(data_df)
    count+=1
    print(f"Processing {count} of {len(log_files_df)}", end ="\r")
combined_log_data_df.info()

#Chenging dtypes
combined_log_data_df['ts'] = pd.to_datetime(combined_log_data_df['ts'])
combined_log_data_df.loc[combined_log_data_df['userId']=='','userId'] = None

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8056 entries, 0 to 145
Data columns (total 18 columns):
artist           6820 non-null object
auth             8056 non-null object
firstName        7770 non-null object
gender           7770 non-null object
itemInSession    8056 non-null int64
lastName         7770 non-null object
length           6820 non-null float64
level            8056 non-null object
location         7770 non-null object
method           8056 non-null object
page             8056 non-null object
registration     7770 non-null float64
sessionId        8056 non-null int64
song             6820 non-null object
status           8056 non-null int64
ts               8056 non-null int64
userAgent        7770 non-null object
userId           8056 non-null object
dtypes: float64(2), int64(4), object(12)
memory usage: 1.2+ MB

In [17]:
combined_log_data_df.head()

,artist,auth,firstName,gender,itemInSession,lastName,length,level,location,method,page,registration,sessionId,song,status,ts,userAgent,userId
0,Stephen Lynch,Logged In,Jayden,M,0,Bell,182.85669,free,"Dallas-Fort Worth-Arlington, TX",PUT,NextSong,1.540992e+12,829,Jim Henson's Dead,200,1543537327796,Mozilla/5.0 (compatible; MSIE 10.0; Windows NT...,91
1,Manowar,Logged In,Jacob,M,0,Klein,247.56200,paid,"Tampa-St. Petersburg-Clearwater, FL",PUT,NextSong,1.540558e+12,1049,Shell Shock,200,1543540121796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",73
2,Morcheeba,Logged In,Jacob,M,1,Klein,257.41016,paid,"Tampa-St. Petersburg-Clearwater, FL",PUT,NextSong,1.540558e+12,1049,Women Lose Weight (Feat: Slick Rick),200,1543540368796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",73
3,Maroon 5,Logged In,Jacob,M,2,Klein,231.23546,paid,"Tampa-St. Petersburg-Clearwater, FL",PUT,NextSong,1.540558e+12,1049,Won't Go Home Without You,200,1543540625796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",73
4,Train,Logged In,Jacob,M,3,Klein,216.76363,paid,"Tampa-St. Petersburg-Clearwater, FL",PUT,NextSong,1.540558e+12,1049,Hey_ Soul Sister,200,1543540856796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",73

In [18]:
combined_log_data_df.columns

Index(['artist', 'auth', 'firstName', 'gender', 'itemInSession', 'lastName',
       'length', 'level', 'location', 'method', 'page', 'registration',
       'sessionId', 'song', 'status', 'ts', 'userAgent', 'userId'],
      dtype='object')

## #3: `time` Table
#### Extract Data for Time Table
- Filter records by `NextSong` action
- Convert the `ts` timestamp column to datetime
  - Hint: the current timestamp is in milliseconds
- Extract the timestamp, hour, day, week of year, month, year, and weekday from the `ts` column and set `time_data` to a list containing these values in order
  - Hint: use pandas' [`dt` attribute](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.dt.html) to access easily datetimelike properties.
- Specify labels for these columns and set to `column_labels`
- Create a dataframe, `time_df,` containing the time data for this file by combining `column_labels` and `time_data` into a dictionary and converting this into a dataframe

In [63]:
df = combined_log_data_df[combined_log_data_df['page']=='NextSong'].copy()

#converting the ts to datetime
df['ts'] = pd.to_datetime(df['ts'], unit ='ms')

df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6820 entries, 0 to 145
Data columns (total 18 columns):
artist           6820 non-null object
auth             6820 non-null object
firstName        6820 non-null object
gender           6820 non-null object
itemInSession    6820 non-null int64
lastName         6820 non-null object
length           6820 non-null float64
level            6820 non-null object
location         6820 non-null object
method           6820 non-null object
page             6820 non-null object
registration     6820 non-null float64
sessionId        6820 non-null int64
song             6820 non-null object
status           6820 non-null int64
ts               6820 non-null datetime64[ns]
userAgent        6820 non-null object
userId           6820 non-null object
dtypes: datetime64[ns](1), float64(2), int64(3), object(12)
memory usage: 1012.3+ KB

,artist,auth,firstName,gender,itemInSession,lastName,length,level,location,method,page,registration,sessionId,song,status,ts,userAgent,userId
0,Stephen Lynch,Logged In,Jayden,M,0,Bell,182.85669,free,"Dallas-Fort Worth-Arlington, TX",PUT,NextSong,1.540992e+12,829,Jim Henson's Dead,200,2018-11-30 00:22:07.796,Mozilla/5.0 (compatible; MSIE 10.0; Windows NT...,91
1,Manowar,Logged In,Jacob,M,0,Klein,247.56200,paid,"Tampa-St. Petersburg-Clearwater, FL",PUT,NextSong,1.540558e+12,1049,Shell Shock,200,2018-11-30 01:08:41.796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",73
2,Morcheeba,Logged In,Jacob,M,1,Klein,257.41016,paid,"Tampa-St. Petersburg-Clearwater, FL",PUT,NextSong,1.540558e+12,1049,Women Lose Weight (Feat: Slick Rick),200,2018-11-30 01:12:48.796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",73
3,Maroon 5,Logged In,Jacob,M,2,Klein,231.23546,paid,"Tampa-St. Petersburg-Clearwater, FL",PUT,NextSong,1.540558e+12,1049,Won't Go Home Without You,200,2018-11-30 01:17:05.796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",73
4,Train,Logged In,Jacob,M,3,Klein,216.76363,paid,"Tampa-St. Petersburg-Clearwater, FL",PUT,NextSong,1.540558e+12,1049,Hey_ Soul Sister,200,2018-11-30 01:20:56.796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",73

In [20]:
#extracting the values timestamp, hour, day, week of year, month, year, and weekday 
df[['ts']], 
t = df[['ts']].copy()
t['hour'] = df['ts'].dt.hour
t['day'] = df['ts'].dt.day
t['week_of_year'] = df['ts'].dt.week
t['month'] = df['ts'].dt.month
t['year'] = df['ts'].dt.year
t['weekday'] = df['ts'].dt.weekday
t.info()
t.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6820 entries, 0 to 145
Data columns (total 7 columns):
ts              6820 non-null datetime64[ns]
hour            6820 non-null int64
day             6820 non-null int64
week_of_year    6820 non-null int64
month           6820 non-null int64
year            6820 non-null int64
weekday         6820 non-null int64
dtypes: datetime64[ns](1), int64(6)
memory usage: 426.2 KB

                       ts  hour  day  week_of_year  month  year  weekday
0 2018-11-30 00:22:07.796     0   30            48     11  2018        4
1 2018-11-30 01:08:41.796     1   30            48     11  2018        4
2 2018-11-30 01:12:48.796     1   30            48     11  2018        4
3 2018-11-30 01:17:05.796     1   30            48     11  2018        4
4 2018-11-30 01:20:56.796     1   30            48     11  2018        4

In [21]:
time_df = t.rename(columns={'ts' : 'start_time'}).copy()
time_df.head()

               start_time  hour  day  week_of_year  month  year  weekday
0 2018-11-30 00:22:07.796     0   30            48     11  2018        4
1 2018-11-30 01:08:41.796     1   30            48     11  2018        4
2 2018-11-30 01:12:48.796     1   30            48     11  2018        4
3 2018-11-30 01:17:05.796     1   30            48     11  2018        4
4 2018-11-30 01:20:56.796     1   30            48     11  2018        4

#### Insert Records into Time Table
Implement the `time_table_insert` query in `sql_queries.py` and run the cell below to insert records for the timestamps in this log file into the `time` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `time` table in the sparkify database.

In [22]:
time_table_insert = ("""
                    INSERT INTO time (start_time, hour, day, week, month, year, weekday) VALUES (%s, %s, %s, %s, %s, %s, %s)
""")

for i, row in time_df.iterrows():
    cur.execute(time_table_insert, list(row))
    conn.commit()

Run `test.ipynb` to see if you've successfully added records to this table.

## #4: `users` Table
#### Extract Data for Users Table
- Select columns for user ID, first name, last name, gender and level and set to `user_df`

In [23]:
df.columns

Index(['artist', 'auth', 'firstName', 'gender', 'itemInSession', 'lastName',
       'length', 'level', 'location', 'method', 'page', 'registration',
       'sessionId', 'song', 'status', 'ts', 'userAgent', 'userId'],
      dtype='object')

In [24]:
df.head()

,artist,auth,firstName,gender,itemInSession,lastName,length,level,location,method,page,registration,sessionId,song,status,ts,userAgent,userId
0,Stephen Lynch,Logged In,Jayden,M,0,Bell,182.85669,free,"Dallas-Fort Worth-Arlington, TX",PUT,NextSong,1.540992e+12,829,Jim Henson's Dead,200,2018-11-30 00:22:07.796,Mozilla/5.0 (compatible; MSIE 10.0; Windows NT...,91
1,Manowar,Logged In,Jacob,M,0,Klein,247.56200,paid,"Tampa-St. Petersburg-Clearwater, FL",PUT,NextSong,1.540558e+12,1049,Shell Shock,200,2018-11-30 01:08:41.796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",73
2,Morcheeba,Logged In,Jacob,M,1,Klein,257.41016,paid,"Tampa-St. Petersburg-Clearwater, FL",PUT,NextSong,1.540558e+12,1049,Women Lose Weight (Feat: Slick Rick),200,2018-11-30 01:12:48.796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",73
3,Maroon 5,Logged In,Jacob,M,2,Klein,231.23546,paid,"Tampa-St. Petersburg-Clearwater, FL",PUT,NextSong,1.540558e+12,1049,Won't Go Home Without You,200,2018-11-30 01:17:05.796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",73
4,Train,Logged In,Jacob,M,3,Klein,216.76363,paid,"Tampa-St. Petersburg-Clearwater, FL",PUT,NextSong,1.540558e+12,1049,Hey_ Soul Sister,200,2018-11-30 01:20:56.796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",73

In [25]:
user_df = df[['userId', 'firstName', 'lastName','gender','level']].drop_duplicates()
user_df['userId'] = pd.to_numeric(user_df['userId'])
user_df.sort_values(by=['userId'], inplace = True)
user_df.reset_index(drop= True, inplace = True)
user_df.head()

   userId firstName  lastName gender level
0       2   Jizelle  Benjamin      F  free
1       3     Isaac    Valdez      M  free
2       4    Alivia   Terrell      F  free
3       5    Elijah     Davis      M  free
4       6   Cecilia     Owens      F  free

#### Insert Records into Users Table
Implement the `user_table_insert` query in `sql_queries.py` and run the cell below to insert records for the users in this log file into the `users` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `users` table in the sparkify database.

In [26]:
for i, row in user_df.iterrows():
    cur.execute(user_table_insert, row)
    conn.commit()

Run `test.ipynb` to see if you've successfully added records to this table.

## #5: `songplays` Table
#### Extract Data and Songplays Table
This one is a little more complicated since information from the songs table, artists table, and original log file are all needed for the `songplays` table. Since the log file does not specify an ID for either the song or the artist, you'll need to get the song ID and artist ID by querying the songs and artists tables to find matches based on song title, artist name, and song duration time.
- Implement the `song_select` query in `sql_queries.py` to find the song ID and artist ID based on the title, artist name, and duration of a song.
- Select the timestamp, user ID, level, song ID, artist ID, session ID, location, and user agent and set to `songplay_data`

#### Insert Records into Songplays Table
- Implement the `songplay_table_insert` query and run the cell below to insert records for the songplay actions in this log file into the `songplays` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `songplays` table in the sparkify database.

In [27]:
combined_log_data_df.head()

,artist,auth,firstName,gender,itemInSession,lastName,length,level,location,method,page,registration,sessionId,song,status,ts,userAgent,userId
0,Stephen Lynch,Logged In,Jayden,M,0,Bell,182.85669,free,"Dallas-Fort Worth-Arlington, TX",PUT,NextSong,1.540992e+12,829,Jim Henson's Dead,200,1543537327796,Mozilla/5.0 (compatible; MSIE 10.0; Windows NT...,91
1,Manowar,Logged In,Jacob,M,0,Klein,247.56200,paid,"Tampa-St. Petersburg-Clearwater, FL",PUT,NextSong,1.540558e+12,1049,Shell Shock,200,1543540121796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",73
2,Morcheeba,Logged In,Jacob,M,1,Klein,257.41016,paid,"Tampa-St. Petersburg-Clearwater, FL",PUT,NextSong,1.540558e+12,1049,Women Lose Weight (Feat: Slick Rick),200,1543540368796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",73
3,Maroon 5,Logged In,Jacob,M,2,Klein,231.23546,paid,"Tampa-St. Petersburg-Clearwater, FL",PUT,NextSong,1.540558e+12,1049,Won't Go Home Without You,200,1543540625796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",73
4,Train,Logged In,Jacob,M,3,Klein,216.76363,paid,"Tampa-St. Petersburg-Clearwater, FL",PUT,NextSong,1.540558e+12,1049,Hey_ Soul Sister,200,1543540856796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",73

In [28]:
#GEtting the users data
cur.execute("SELECT * FROM songs")
column_names = [ x[0] for x in cur.description]
users_db_df = pd.DataFrame(cur.fetchall(), columns = column_names)
users_db_df.head()

,song_id,title,artist_id,year,duration
0,SOMZWCG12A8C13C480,I Didn't Mean To,ARD7TVE1187B99BFB1,0,219
1,SOUDSGM12AC9618304,Insatiable (Instrumental Version),ARNTLGG11E2835DDB9,0,266
2,SOIAZJW12AB01853F1,Pink World,AR8ZCNI1187B9A069B,1984,270
3,SOHKNRJ12A6701D1F8,Drop of Rain,AR10USD1187B99F3F1,0,190
4,SOCIWDW12A8C13D406,Soul Deep,ARMJAGH1187FB546F3,1969,148

In [29]:
users_db_df[users_db_df['title']=="Shell Shock"]

Empty DataFrame
Columns: [song_id, title, artist_id, year, duration]
Index: []

In [30]:
song_select = ("""
                SELECT songs.song_id, songs.title, songs.duration, artists.artist_id, artists.name
                            FROM 
                                (songs
                                    JOIN artists ON artists.artist_id = songs.artist_id)
                            WHERE 
                                songs.title = %s AND artists.name = %s AND songs.duration = %s
            """)

cur.execute(song_select,["Pink World", "Planet P Project", "270"])
column_names = [ x[0] for x in cur.description]
results_df = pd.DataFrame(cur.fetchall(), columns = column_names)
results_df.head()

,song_id,title,duration,artist_id,name
0,SOIAZJW12AB01853F1,Pink World,270,AR8ZCNI1187B9A069B,Planet P Project

In [31]:
combined_log_data_df[combined_log_data_df['song']=="Pink World"]

Empty DataFrame
Columns: [artist, auth, firstName, gender, itemInSession, lastName, length, level, location, method, page, registration, sessionId, song, status, ts, userAgent, userId]
Index: []

In [32]:
#GEtting the users data
cur.execute("SELECT * FROM users")
column_names = [ x[0] for x in cur.description]
users_db_df = pd.DataFrame(cur.fetchall(), columns = column_names)
users_db_df.head()

   user_id first_name last_name gender level
0        2    Jizelle  Benjamin      F  free
1        3      Isaac    Valdez      M  free
2        4     Alivia   Terrell      F  free
3        5     Elijah     Davis      M  free
4        6    Cecilia     Owens      F  free

In [33]:
combined_log_data_df.columns

Index(['artist', 'auth', 'firstName', 'gender', 'itemInSession', 'lastName',
       'length', 'level', 'location', 'method', 'page', 'registration',
       'sessionId', 'song', 'status', 'ts', 'userAgent', 'userId'],
      dtype='object')

In [34]:
songs_db_df.columns

NameError: name 'songs_db_df' is not defined

In [55]:
#GEtting the users data
cur.execute("SELECT * FROM users")
column_names = [ x[0] for x in cur.description]
users_db_df = pd.DataFrame(cur.fetchall(), columns = column_names)
users_db_df.head()

cur.execute("SELECT * FROM artists")
column_names = [ x[0] for x in cur.description]
artists_db_df = pd.DataFrame(cur.fetchall(), columns = column_names)
artists_db_df.head()

cur.execute("SELECT * FROM songs")
column_names = [ x[0] for x in cur.description]
songs_db_df = pd.DataFrame(cur.fetchall(), columns = column_names)
songs_db_df.head()

#GEtting the songplay data

song_artist_data_select = ("""
                            SELECT songs.song_id, songs.title, songs.duration, artists.artist_id, artists.name
                                        FROM 
                                            (songs
                                                JOIN artists ON artists.artist_id = songs.artist_id)
                        """)
cur.execute(song_artist_data_select)
column_names = [ x[0] for x in cur.description]
song_artist_data_db_df = pd.DataFrame(cur.fetchall(), columns = column_names)
song_artist_data_db_df.head()

#Adding the songid to the log data dataset
song_play_data_df = combined_log_data_df.merge(song_artist_data_db_df.rename(columns ={'title' : 'song'}), on =['song'], how = 'left')

#removing entries with null song_id
song_play_data_df = song_play_data_df[song_play_data_df['song_id'].notnull()]

#Selecting the requied columns
song_play_data_df = song_play_data_df[['ts', 'userId', 'level', 'sessionId', 'location', 'userAgent', 'song_id', 'artist_id']].reset_index(drop = True)
song_play_data_df

,ts,userId,level,sessionId,location,userAgent,song_id,artist_id
0,1542171963796,10,free,484,"Washington-Arlington-Alexandria, DC-VA-MD-WV","""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",SOGDBUF12A8C140FAA,AR558FS1187FB45658
1,1543358159796,80,paid,992,"Portland-South Portland, ME","""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",SOGDBUF12A8C140FAA,AR558FS1187FB45658
2,1542837407796,15,paid,818,"Chicago-Naperville-Elgin, IL-IN-WI","""Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/5...",SOZCTXZ12AB0182364,AR5KOSW1187FB35FF4
3,1542618860796,24,paid,672,"Lake Havasu City-Kingman, AZ","""Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebK...",SOGDBUF12A8C140FAA,AR558FS1187FB45658

In [81]:
conn.rollback()

In [83]:
import traceback

song_select = ("""
                SELECT songs.song_id, songs.title, songs.duration, artists.artist_id, artists.name
                            FROM 
                                (songs
                                    JOIN artists ON artists.artist_id = songs.artist_id)
                            WHERE 
                                songs.title = %s AND artists.name = %s AND songs.duration = %s
            """)

for index, row in combined_log_data_df.iterrows():

    # get songid and artistid from song and artist tables
    cur.execute(song_select, (row.song, row.artist, row.length))
    results = cur.fetchone()
    
    if results:
        songid, artistid = results
    else:
        songid, artistid = None, None

    # insert songplay record
    try:
        songplay_id = index+1
        start_time = row['ts']
        user_id = row['userId']
        level = row['level']
        session_id = row['sessionId']
        location = row['location']
        user_agent = row['userAgent']    
        songplay_data = [songplay_id, start_time, user_id, level, songid, artistid, session_id, location, user_agent]
        cur.execute(songplay_table_insert, songplay_data)
        conn.commit()
    except:
        print(f"{songplay_data}")
        print(f"There was an error {traceback.format_exec()}")

In [84]:
cur.execute("SELECT * FROM songplays")
column_names = [ x[0] for x in cur.description]
df = pd.DataFrame(cur.fetchall(), columns = column_names)
df.head()

,songplay_id,start_time,user_id,level,song_id,artist_id,session_id,location,user_agent
0,1,1970-01-01 00:25:43.537328,91.0,free,None,None,829,"Dallas-Fort Worth-Arlington, TX",Mozilla/5.0 (compatible; MSIE 10.0; Windows NT...
1,2,1970-01-01 00:25:43.540122,73.0,paid,None,None,1049,"Tampa-St. Petersburg-Clearwater, FL","""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4..."
2,3,1970-01-01 00:25:43.540369,73.0,paid,None,None,1049,"Tampa-St. Petersburg-Clearwater, FL","""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4..."
3,4,1970-01-01 00:25:43.540626,73.0,paid,None,None,1049,"Tampa-St. Petersburg-Clearwater, FL","""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4..."
4,5,1970-01-01 00:25:43.540857,73.0,paid,None,None,1049,"Tampa-St. Petersburg-Clearwater, FL","""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4..."

Run `test.ipynb` to see if you've successfully added records to this table.

# Close Connection to Sparkify Database

In [36]:
cur.close()
conn.close()

# Implement `etl.py`
Use what you've completed in this notebook to implement `etl.py`.